Revit 2027 API
ScheduleDefinition.IsFilteredBySheet Property
 Indicates if the schedule is set to filter by sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFilteredBySheet { get; set; }
Public Property IsFilteredBySheet As Boolean
	Get
	Set
public:
property bool IsFilteredBySheet {
	bool get ();
	void set (bool value);
}
member IsFilteredBySheet : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The schedule category is not supported to use filter by sheet. -or- When setting this property: The Schedule is split already.
Remarks
 If the schedule is set to filter by sheet, and it is placed on a particular sheet, the instance created will present only the elements visible in the Viewport(s) on that sheet.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace